app/controllers/users_controller.rb

  def create_xml
    @user = User.new(params[:user])
    @user.save!
---
INSERT INTO `users` (`name`, `salt`, `updated_at`, `crypted_password`, `remember_token_expires_at`, `remember_token`, `first_name`, `login`, `last_name`, `email`, `created_at`) VALUES('', 'a792e57d1c7a799aed2a0a544d99b03ab69c8940', '2010-11-02 13:46:24', 'a541db736f346f254f7ba1a27f9dda706c9be62c', NULL, NULL, 'Vineeth', 'vineeth', 'Pradhan', 'vineeth@gmail.com', '2010-11-02 13:46:24')